In [1]:
import pandas as pd
import numpy as np

In [2]:
data = [[3, 108939], [2, 12747], [8, 87709], [6, 91796]]
accounts = pd.DataFrame(data, columns=['account_id', 'income']).astype({'account_id':'Int64', 'income':'Int64'})

In [3]:
accounts

   account_id  income
0           3  108939
1           2   12747
2           8   87709
3           6   91796

In [20]:
def count_salary_categories(accounts):
    df = pd.DataFrame({'category' : ['Low Salary', 'Average Salary', 'High Salary'],
                       'count': [accounts[accounts['income'] < 20000].shape[0],
                                accounts[(accounts['income'] >= 20000) & (accounts['income'] <= 50000)].shape[0],
                                accounts[accounts['income'] > 50000].shape[0]]})
    return df

In [22]:
count_salary_categories(accounts)

         category  count
0      Low Salary      1
1  Average Salary      0
2     High Salary      3